0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);

boundaryField
{
    Side
    {
        type            empty;
    }
    Airfoil
    {
        type            noSlip;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform (100 0 0);
        value           uniform (100 0 0);
    }
    FreeStream
    {
        type            freestreamVelocity;
        freestreamValue uniform (100 0 0);
        value           uniform (100 0 0);
    }
    Outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
