0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    Side
    {
        type            empty;
    }
    Airfoil
    {
        type            zeroGradient;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 100000;
        value           uniform 100000;
    }
    FreeStream
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        value           uniform 100000;
    }
    Outlet
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        100000;
        lInf            5;
        value           uniform 100000;
    }
}


// ************************************************************************* //
