0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    Side
    {
        type            empty;
    }
    Airfoil
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 10;
    }
    FreeStream
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    Outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
